//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
let time = +prompt("число от 0 до 59")
if (time >= 0 && time <= 15){
    console.log("1 четверть")
} else if (time >= 16 && time <= 30){
    console.log("2 четверть")
} else if (time >= 31 && time <= 45){
    console.log("3 четверть")
} else if (time >= 45 && time <= 59){
    console.log("4 четверть") // працюэ без else Чи так ок теж ?
} else {
    console.log("Error") // працюэ без else Чи так ок теж ?
}
/*- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).*/
// let day = +prompt("число от 1 до 39")
// if (day => 1 && day => 10){ // не работает ... не понял почему переменная черным и подчеркнута.//
//     console.log("1D")
// }
// if (day => 11 && day => 20){
//     console.log("2D")
// }
// if (day => 21 && day => 31){
//     console.log("3D")
// }
for (const timeKey in time) {

}
for (const timeElement of time) {
    
}