//--створити масив з:
// - з 5 числових значень
let masNumbers =[0, 2, 3, 4, 5]
// - з 5 стічкових значень
let mastxt = ["Жизнь", "— это", "не те дни", ", что прошли,", "а те, что запомнились"]
// - з 5 значень стрічкового, числового та булевого типу
let mas = [
    {
        name: 'Pavlo',
        lastN: 'Sterin',
        age: 34,
        stat: true,
        experience: 11
       },
    {   name: 'Jen',
        lastN: 'Petson',
        age: 21,
        stat: false,
        experience: 1
    },
    {
        name: 'Jon',
        lastN: 'Konnor',
        age: 53,
        stat: true,
        experience: 20
    },
    {
        name: 'Nick',
        lastN: 'Iuron',
        age: 35,
        stat: true,
        experience: 15
    },
    {
        name: 'Igor',
        lastN: 'Petrov',
        age: 33,
        stat: false,
        experience: 10
    }

]
// - та вивести його в консоль
console.log(mas)
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write